In [1]:
# Let's load a new dataset on the number of fires in the Amazon rainforest 

import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")

df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [2]:
print(df['ano'].unique())
print(df['mes'].unique())
print(df['estado'].unique())
print(df['numero'].unique())
print(df['encontro'].unique())

[1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
 2012 2013 2014 2015 2016 2017]
['Janeiro' 'Fevereiro' 'Março' 'Abril' 'Maio' 'Junho' 'Julho' 'Agosto'
 'Setembro' 'Outubro' 'Novembro' 'Dezembro']
['Acre' 'alagoas' 'Amapa' 'Amazonas' 'Bahia' 'Ceara' 'Distrito Federal'
 'Espirito Santo' 'Goias' 'Maranhao' 'Mato Grosso' 'Minas Gerais' 'pará'
 'Paraiba' 'Pernambuco' 'Piau' 'Rio' 'rondonia' 'Roraima' 'Santa Catarina'
 'Sao Paulo' 'Sergipe' 'Tocantins']
['0 Fires' '10 Fires' '12 Fires' ... '2.032' '833' '623']
['1/1/1998' '1/1/1999' '1/1/2000' '1/1/2001' '1/1/2002' '1/1/2003'
 '1/1/2004' '1/1/2005' '1/1/2006' '1/1/2007' '1/1/2008' '1/1/2009'
 '1/1/2010' '1/1/2011' '1/1/2012' '1/1/2013' '1/1/2014' '1/1/2015'
 '1/1/2016' '1/1/2017']

In [12]:
df.rename(columns = {'ano' : 'year','mes' : 'state','estado' : 'month', 'numero' : 'number_of_fires','encontro' : 'date'}
          , inplace = True)
df.head(5)

   year    state month number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [55]:
new_columns = { 'ano' : 'year',
               'mes' : 'state',
               'estado' : 'month',
               'numero' : 'number_of_fires',
               'encontro' : 'date'}
df.rename(columns = new_columns, inplace = True)

In [56]:
df.head()

   year    state month number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   state            6454 non-null   object
 2   month            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 302.5+ KB

In [14]:
df.columns

Index(['year', 'state', 'month', 'number_of_fires', 'date'], dtype='object')

In [16]:
df.columns[[0,1,2,3,4]]

Index(['year', 'state', 'month', 'number_of_fires', 'date'], dtype='object')

In [19]:
new_order = [4,1,0,2,3]

df = df[df.columns[new_order]]
df.head()

  number_of_fires    state      date  year month
0         0 Fires  Janeiro  1/1/1998  1998  Acre
1         0 Fires  Janeiro  1/1/1999  1999  Acre
2         0 Fires  Janeiro  1/1/2000  2000  Acre
3         0 Fires  Janeiro  1/1/2001  2001  Acre
4         0 Fires  Janeiro  1/1/2002  2002  Acre

# Determing if a column contains numeric data

In [61]:
df['number_of_fires'].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [21]:
df[df['number_of_fires'].str.isnumeric()]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [26]:
df['number_of_fires'].str.isnumeric()[0:6453:1000]

0       False
1000     True
2000    False
3000     True
4000     True
5000     True
6000     True
Name: number_of_fires, dtype: object

In [63]:
df['number_of_fires'].str.isdigit()[0:6453:1000]

0       False
1000     True
2000    False
3000     True
4000     True
5000     True
6000     True
Name: number_of_fires, dtype: object

In [33]:
df['number_of_fires'].isnull().unique()

array([False,  True])

In [34]:
df[df['number_of_fires'].astype(str).str.isdigit()]

     number_of_fires     state      date  year      month
239                0   Janeiro  1/1/1998  1998    alagoas
240               58   Janeiro  1/1/1999  1999    alagoas
241               11   Janeiro  1/1/2000  2000    alagoas
242                5   Janeiro  1/1/2001  2001    alagoas
243               12   Janeiro  1/1/2002  2002    alagoas
...              ...       ...       ...   ...        ...
6449             128  Dezembro  1/1/2012  2012  Tocantins
6450              85  Dezembro  1/1/2013  2013  Tocantins
6451             223  Dezembro  1/1/2014  2014  Tocantins
6452             373  Dezembro  1/1/2015  2015  Tocantins
6453             119  Dezembro  1/1/2016  2016  Tocantins

[4642 rows x 5 columns]

In [65]:
df[df['number_of_fires'].astype(str).str.isdigit()]

          date     state  year      month number_of_fires
239   1/1/1998   Janeiro  1998    alagoas               0
240   1/1/1999   Janeiro  1999    alagoas              58
241   1/1/2000   Janeiro  2000    alagoas              11
242   1/1/2001   Janeiro  2001    alagoas               5
243   1/1/2002   Janeiro  2002    alagoas              12
...        ...       ...   ...        ...             ...
6449  1/1/2012  Dezembro  2012  Tocantins             128
6450  1/1/2013  Dezembro  2013  Tocantins              85
6451  1/1/2014  Dezembro  2014  Tocantins             223
6452  1/1/2015  Dezembro  2015  Tocantins             373
6453  1/1/2016  Dezembro  2016  Tocantins             119

[4642 rows x 5 columns]

# Removing unnecessary text from columns

In [35]:
txt = "                   banana "

x = txt.strip()

print("of all fruits", x, "is my favorite")

of all fruits banana is my favorite

In [67]:
df['number_of_fires']

0       0 Fires
1       0 Fires
2       0 Fires
3       0 Fires
4       0 Fires
         ...
6449        128
6450         85
6451        223
6452        373
6453        119
Name: number_of_fires, Length: 6454, dtype: object

In [68]:
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df.head()

       date    state  year month number_of_fires
0  1/1/1998  Janeiro  1998  Acre               0
1  1/1/1999  Janeiro  1999  Acre               0
2  1/1/2000  Janeiro  2000  Acre               0
3  1/1/2001  Janeiro  2001  Acre               0
4  1/1/2002  Janeiro  2002  Acre               0

# Handling missing data

In [69]:
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns,inplace= True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [70]:
df_copy.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [71]:
df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [72]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [74]:
df = df.dropna()
df = df.reset_index()
df.head()

   index  year    month state number_of_fires      date
0      0  1998  Janeiro  Acre               0  1/1/1998
1      1  1999  Janeiro  Acre               0  1/1/1999
2      2  2000  Janeiro  Acre               0  1/1/2000
3      3  2001  Janeiro  Acre               0  1/1/2001
4      4  2002  Janeiro  Acre               0  1/1/2002

In [75]:
df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [36]:
# Alright so it worked, now let's reload the data and look at a few other methods of dealing with NaN or Null values

# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [37]:
print(df['number_of_fires'].isnull())

0       False
1       False
2       False
3       False
4       False
        ...
6449    False
6450    False
6451    False
6452    False
6453    False
Name: number_of_fires, Length: 6454, dtype: bool

In [38]:
df[df['number_of_fires'].isnull()].head()

     year     month state number_of_fires      date
68   2006     Abril  Acre             NaN  1/1/2006
110  2008     Junho  Acre             NaN  1/1/2008
127  2005     Julho  Acre             NaN  1/1/2005
206  2004  Novembro  Acre             NaN  1/1/2004
217  2015  Novembro  Acre             NaN  1/1/2015

In [39]:
df['number_of_fires'][68]

nan

In [40]:
df['number_of_fires'].fillna(0)

0         0
1         0
2         0
3         0
4         0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: number_of_fires, Length: 6454, dtype: object

In [103]:
df_copy = df.copy()

In [104]:
df_copy['number_of_fires'][68]

nan

In [105]:
df_copy = df_copy.fillna(0)

In [106]:
df_copy['number_of_fires'][68]

0

In [110]:
df.iloc[68]

year                   2006
month                 Abril
state                  Acre
number_of_fires         NaN
date               1/1/2006
Name: 68, dtype: object

In [118]:
df["number_of_fires"] = df["number_of_fires"].replace('','0').astype(float)

In [119]:
df.head()

   year    month state  number_of_fires      date
0  1998  Janeiro  Acre              0.0  1/1/1998
1  1999  Janeiro  Acre              0.0  1/1/1999
2  2000  Janeiro  Acre              0.0  1/1/2000
3  2001  Janeiro  Acre              0.0  1/1/2001
4  2002  Janeiro  Acre              0.0  1/1/2002

In [121]:
df["number_of_fires"] = df["number_of_fires"].fillna(0)

In [122]:
df.isnull().sum()

year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [137]:
df['month'].unique()

array([nan], dtype=object)

In [150]:
# Let's load a new dataset on the number of fires in the Amazon rainforest 

import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")

df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [152]:
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}

df.rename(columns = new_columns, inplace=True)

In [153]:
month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'Março': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df["month"] = df["month"].map(month_translations)
df["month"].head()

0    January
1    January
2    January
3    January
4    January
Name: month, dtype: object

In [154]:
df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [155]:
df['state'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [156]:
df.head()

   year    month state number_of_fires      date
0  1998  January  Acre         0 Fires  1/1/1998
1  1999  January  Acre         0 Fires  1/1/1999
2  2000  January  Acre         0 Fires  1/1/2000
3  2001  January  Acre         0 Fires  1/1/2001
4  2002  January  Acre         0 Fires  1/1/2002

In [157]:
df.drop('date', axis = 1)

      year     month      state number_of_fires
0     1998   January       Acre         0 Fires
1     1999   January       Acre         0 Fires
2     2000   January       Acre         0 Fires
3     2001   January       Acre         0 Fires
4     2002   January       Acre         0 Fires
...    ...       ...        ...             ...
6449  2012  December  Tocantins             128
6450  2013  December  Tocantins              85
6451  2014  December  Tocantins             223
6452  2015  December  Tocantins             373
6453  2016  December  Tocantins             119

[6454 rows x 4 columns]

In [158]:
df.head()

   year    month state number_of_fires      date
0  1998  January  Acre         0 Fires  1/1/1998
1  1999  January  Acre         0 Fires  1/1/1999
2  2000  January  Acre         0 Fires  1/1/2000
3  2001  January  Acre         0 Fires  1/1/2001
4  2002  January  Acre         0 Fires  1/1/2002

In [159]:
# Let's reload the data

# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [162]:
df = df.drop(['year','date'],axis = 1)
df.head()

     month state number_of_fires
0  Janeiro  Acre               0
1  Janeiro  Acre               0
2  Janeiro  Acre               0
3  Janeiro  Acre               0
4  Janeiro  Acre               0

In [164]:
df = df.drop(df.index[0])
df.head()

     month state number_of_fires
1  Janeiro  Acre               0
2  Janeiro  Acre               0
3  Janeiro  Acre               0
4  Janeiro  Acre               0
5  Janeiro  Acre              10

In [165]:
df = df.reset_index()
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
2      3  Janeiro  Acre               0
3      4  Janeiro  Acre               0
4      5  Janeiro  Acre              10

In [166]:
df = df.drop(df.index[1:4])
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
4      5  Janeiro  Acre              10
5      6  Janeiro  Acre               0
6      7  Janeiro  Acre              12
7      8  Janeiro  Acre               4

In [4]:
# Let's convert our Portuguese month names to English

month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'Março': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df['month'] = df['month'].map(month_translations)
df.head(5)

   year    month state number_of_fires      date
0  1998  January  Acre               0  1/1/1998
1  1999  January  Acre               0  1/1/1999
2  2000  January  Acre               0  1/1/2000
3  2001  January  Acre               0  1/1/2001
4  2002  January  Acre               0  1/1/2002

In [5]:
df['month'].unique()

array(['January', 'February', 'March', 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December'],
      dtype=object)

In [7]:
df['state'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [8]:
df['state'] = df['state'].str.title()
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

In [9]:
print("1w")

1w

In [10]:
# Let's reload the data

# Let's reload our dataframe
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [11]:
# Drop multiple columns 
df = df.drop(["year", "date"], axis=1)
df.head()

     month state number_of_fires
0  Janeiro  Acre               0
1  Janeiro  Acre               0
2  Janeiro  Acre               0
3  Janeiro  Acre               0
4  Janeiro  Acre               0

In [16]:
# Let's drop the first row 
df = df.drop(df.index[0])
df = df.reset_index()
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
2      3  Janeiro  Acre               0
3      4  Janeiro  Acre               0
4      5  Janeiro  Acre              10

In [21]:
# Drop multiple rows

df = df.drop(df.index[[2,3]])
df = df.reset_index()
df.head()

   level_0  index    month state number_of_fires
0        0      1  Janeiro  Acre               0
1        1      2  Janeiro  Acre               0
2        8      9  Janeiro  Acre               0
3        9     10  Janeiro  Acre               0
4       10     11  Janeiro  Acre               0